[
  {
    "id": 1,
    "title": "Web-Development Study Tool",
    "path": "project-one",
    "shortDescription": "Our primary motivation was to provide an intuitive, visually clear and useful tool for students learning how to code.",
    "description": "Our primary motivation was to provide an intuitive, visually clear and useful tool for students learning how to code. This project is created by eDX Bootcamp students hoping to improve the strenuous coding journey for current and future learners. To the best of our ability, we perfected a Website using YouTube and Wikipedia APIs, to supply users with sufficient information to their queries. This journey taught us how to co-operate as a team and gave us the opportunity to understand the usage of GitHub in professional settings; especially branching. It also further developed our previous knowledge, learning from one another during pair programming practise and helped identify our individual strengths.",
    "deployedLink": "https://ben-rumbold.github.io/web-development-study-tool/",
    "githubLink": "https://github.com/Ben-Rumbold/web-development-study-tool",
    "screenshot": "/project1-screenshot.jpg"
  },
  {
    "id": 2,
    "title": "React Portfolio",
    "path": "project-two",
    "shortDescription": "Welcome to Adrian's React Portfolio! This is a dynamic and interactive web application built using React.js, designed to showcase my skills, projects, and experiences in an elegant and engaging manner.",
    "description": "Responsive Design: My portfolio is optimized to look great on all devices, from desktops to smartphones, ensuring a seamless browsing experience for visitors.",
    "deployedLink": " https://adriantutuianu.github.io/react-portfolio/.",
    "githubLink": "https://github.com/Adriantutuianu/react-portfolio",
    "screenshot": "/project2-screenshot.png"
  },
  {
    "id": 3,
    "title": "Team Profile Generator App",
    "path": "project-three",
    "shortDescription": "This command-line application generates HTML files based on input provided via a user interface. It is designed to help managers quickly generate a webpage displaying basic information about their team members, including their names, IDs, email addresses, and additional details such as GitHub usernames or schools for engineers and interns respectively.",
    "description": "This command-line application generates HTML files based on input provided via a user interface. It is designed to help managers quickly generate a webpage displaying basic information about their team members, including their names, IDs, email addresses, and additional details such as GitHub usernames or schools for engineers and interns respectively.",
    "deployedLink": "",
    "githubLink": "https://github.com/Adriantutuianu/team-profile-generator-app-challenge",
    "screenshot": "/project3-screenshot.png"
  },
  {
    "id": 4,
    "title": "Weather-Dashboard-App",
    "path": "project-four",
    "shortDescription": "Introducing our Weather Dashboard App, your go-to destination for real-time weather information and a 5-day forecast for any city worldwide!",
    "description": "Introducing our Weather Dashboard App, your go-to destination for real-time weather information and a 5-day forecast for any city worldwide! With a sleek and user-friendly interface crafted using HTML, CSS, and JavaScript, this app seamlessly integrates the power of the OpenWeatherMap API to deliver accurate and up-to-date weather data. Experience the convenience of searching for weather conditions in any city, complemented by an intuitive design enhanced with JQuery and JQuery UI. Whether you're planning a trip, checking in on loved ones, or simply staying informed, our Weather Dashboard App provides a reliable and visually appealing platform for all your weather-related needs. Powered by DayJS and enriched with Bootstrap, this app ensures a responsive and enjoyable experience, bringing the world's weather to your fingertips. Stay ahead of the forecast with our Weather Dashboard App – where simplicity meets precision!",
    "deployedLink": "https://adriantutuianu.github.io/weather-dashboard-app-challenge/",
    "githubLink": "https://github.com/Adriantutuianu/weather-dashboard-app-challenge",
    "screenshot": "/project4-screenshot.png"
  },
  {
    "id": 5,
    "title": "Daily Planner App",
    "path": "project-five",
    "shortDescription": "Explore the Daily Planner App – a dynamic web application meticulously built with HTML, CSS, JavaScript, jQuery, jQuery UI, and enhanced by the precision of Day.js. ",
    "description": "Explore the Daily Planner App – a dynamic web application meticulously built with HTML, CSS, JavaScript, jQuery, jQuery UI, and enhanced by the precision of Day.js. Organize your days effortlessly with this responsive and interactive planner, offering a seamless blend of user-friendly design and advanced functionality for a productive daily experience.",
    "deployedLink": "https://adriantutuianu.github.io/daily-planner-app-calendar-third-party-apis/",
    "githubLink": "https://github.com/Adriantutuianu/daily-planner-app-calendar-third-party-apis",
    "screenshot": "/project5-screenshot.png"
  },
  {
    "id": 6,
    "title": "Random Password Generator",
    "path": "project-six",
    "shortDescription": "A dynamic web page built with HTML, CSS, and JavaScript. ",
    "description": "A dynamic web page built with HTML, CSS, and JavaScript. This project showcases a modern and responsive design, with interactive features powered by custom JavaScript functions. Explore the seamless blend of front-end technologies to create an engaging user experience.",
    "deployedLink": "https://adriantutuianu.github.io/magic-random-password-generator-app/",
    "githubLink": "https://github.com/Adriantutuianu/magic-random-password-generator-app",
    "screenshot": "/project6-screenshot.png"
  }
]
